Revit 2027 API
ViewDisplayBackground.SkyColor Property
 The color of the sky when the type is 'Gradient'.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color SkyColor { get; }
Public ReadOnly Property SkyColor As Color
	Get
public:
property Color^ SkyColor {
	Color^ get ();
}
member SkyColor : Color with get
Property Value
Color
See Also
Reference
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace